BaseConfiguration/Money_2_0/Catalogs/Имущество.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Имущество</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПокупнаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПродажи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаПродажи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыручкаОтПродажи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыручкаОтПродажиВВалютеИмущества</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаборСвойств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаборыДополнительныхРеквизитовИСведений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольнаяСумма</Name>
					<Comment>Контрольная сумма объекта</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>65</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МоментИзменения</Name>
					<Comment>Универсальное время последнего изменения объекта в миллисекундах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

BaseConfiguration/Money_2_0/Catalogs/Имущество/Forms/ПродажаИмущества/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ВернутьВРежимПросмотра Экспорт;


#КонецОбласти

#Область ОбработчикиСобытийФормы


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если ЗначениеЗаполнено(ВалютаУчета) Тогда
		// выполняется повторное чтение объекта
		ЗаполнитьРеквизитыПоОбъекту();
		ОбновитьЭлементыФормы(ЭтотОбъект);
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		Отказ = Истина;
		ВызватьИсключение НСтр("ru='Не выбрано имущество для прдажи'");
	КонецЕсли;
	
	ВалютаУчета = ПараметрыСеанса.ВалютаУчета;
	
	// реквизиты, связанные с объектом
	ЗаполнитьРеквизитыПоОбъекту();
	Если ОперацияДоступна И Не ЗначениеЗаполнено(Кошелек) Тогда
		Кошелек = ПользовательскиеНастройкиДеньгиСервер.ОсновнойКошелек();
		КошелекПриИзмененииСервер();
	КонецЕсли;
	
	
	// видимость, доступность, оформление элементов формы
	ОбновитьЭлементыФормы(ЭтотОбъект);
	
КонецПроцедуры


&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ПроверяемыеРеквизиты.Очистить();
	
	Если ОперацияДоступна Тогда
		
		ПроверяемыеРеквизиты.Добавить("Объект.ДатаПродажи");
		ПроверяемыеРеквизиты.Добавить("ДатаПродажи");
		ПроверяемыеРеквизиты.Добавить("Кошелек");
		Если Объект.ВыручкаОтПродажиВВалютеИмущества > УчетнаяСтоимость Тогда
			ПроверяемыеРеквизиты.Добавить("СтатьяДохода");
		ИначеЕсли Объект.ВыручкаОтПродажиВВалютеИмущества < УчетнаяСтоимость Тогда
			ПроверяемыеРеквизиты.Добавить("СтатьяРасхода");
		КонецЕсли;
		
	Иначе
		ПроверяемыеРеквизиты.Добавить("Объект.ВалютаПродажи");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ОперацияДоступна И Не ЗначениеЗаполнено(ТекущийОбъект.ДатаПродажи) Тогда
		ТекущийОбъект.ДатаПродажи = ТекущаяДатаСеанса();
	КонецЕсли;
	 
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Записан элемент справочника", Новый Структура("ИмяСправочника,Ссылка,ВладелецФормы", "Имущество", Объект.Ссылка, ?(ТипЗнч(ВладелецФормы) = Тип("ФормаКлиентскогоПриложения"), ВладелецФормы.УникальныйИдентификатор, Неопределено)));
	Если ЗначениеЗаполнено(ОперацияПродажи) Тогда
		Оповестить("Записана операция", Новый Структура("Дата, ВидДокумента, Ссылка, ЭтоШаблон, ВладелецФормы", 
			Объект.ДатаПродажи, "УниверсальнаяОперация", ОперацияПродажи, Ложь, 
			?(ТипЗнч(ВладелецФормы) = Тип("ФормаКлиентскогоПриложения"), ВладелецФормы.УникальныйИдентификатор, Неопределено)));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ОперацияДоступна Тогда
		ЗаписатьОперациюПродажи(ТекущийОбъект);
	КонецЕсли;
	ОбновитьЭлементыФормы(ЭтотОбъект);
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы


&НаКлиенте
Процедура КошелекПриИзменении(Элемент)
	
	КошелекПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыручкаОтПродажиПриИзменении(Элемент)
	ПересчитатьВыручкуВВалютуИмущества(ЭтотОбъект);
КонецПроцедуры


&НаКлиенте
Процедура ВалютаПродажиПриИзменении(Элемент)
	ПересчитатьВыручкуВВалютуИмущества(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ДатаПродажиПриИзменении(Элемент)
	ПересчитатьВыручкуВВалютуИмущества(ЭтотОбъект);
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьОперациюПродажи(Команда)
	
	Если Не ОперацияДоступна Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Операция продажи не найдена.
				|Возможно, она была удалена при обмене даными или вручную'"));
	ИначеЕсли Не ЗначениеЗаполнено(ОперацияПродажи) Тогда
		Возврат;
	Иначе
		ПараметрыФормы = Новый Структура("Ключ", ОперацияПродажи);
		ОткрытьФорму("Документ.УниверсальнаяОперация.Форма.ФормаДокумента", ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьПродажу(Команда)
	
	#Область ПоказатьВопрос
	ТекстВопроса = НСтр("ru='Отмеить продажу этого имущества?'");
	
	ДополнительныеПараметры = Новый Структура;
	Оповещение = Новый ОписаниеОповещения("ОтменитьПродажуЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить(КодВозвратаДиалога.Да,     НСтр("ru='Да'"));
	Кнопки.Добавить(КодВозвратаДиалога.Нет,    НСтр("ru='Нет'"));
	
	ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки, , КодВозвратаДиалога.Да, Заголовок);
	#КонецОбласти
	 
	
КонецПроцедуры


#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьРеквизитыПоОбъекту()
	
	УчетнаяСтоимость  = 0;
	СуммаПрибыли      = 0;
	СуммаУбытка       = 0;
	
	СвойстваПоСсылке = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Ссылка, "Ссылка,Валюта,ДатаПродажи,ВалютаПродажи,ВыручкаОтПродажи,ВыручкаОтПродажиВВалютеИмущества");
	УжеПродано = ЗначениеЗаполнено(СвойстваПоСсылке.ДатаПродажи) И ЗначениеЗаполнено(СвойстваПоСсылке.ВалютаПродажи);
	Если УжеПродано Тогда
		ОперацияПродажи = НайтиОперациюПродажи(СвойстваПоСсылке);
	Иначе
		ОперацияПродажи = Неопределено;
	КонецЕсли;
	
	ОперацияДоступна = Не УжеПродано Или ЗначениеЗаполнено(ОперацияПродажи);
	УчетнаяСтоимость = ПолучитьТекущийОстаток(Объект.Ссылка, Объект.ДатаПродажи);
	
	Если ОперацияДоступна И ЗначениеЗаполнено(Объект.ВыручкаОтПродажи) Тогда
		
		ЗаполнитьПоляПоОперацииПродажи();
		
	Иначе
		
		Если Объект.ВыручкаОтПродажиВВалютеИмущества > УчетнаяСтоимость Тогда
			СуммаПрибыли = Объект.ВыручкаОтПродажиВВалютеИмущества - УчетнаяСтоимость;
		Иначе
			СуммаУбытка = УчетнаяСтоимость - Объект.ВыручкаОтПродажиВВалютеИмущества;
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТекущийОстаток(Знач Ссылка, Знач ДатаПродажи)

	Счет = ПланыСчетов.РазделыУчета.Имущество;
	ДатаОстатка = ?(ЗначениеЗаполнено(ДатаПродажи), 
				НачалоДня(ДатаПродажи), 
				КонецДня(ТекущаяДатаСеанса()));
	Возврат РазделыУчета.ПолучитьОстатокПоСубконто(Счет, Ссылка, ДатаПродажи);

КонецФункции

&НаСервереБезКонтекста
Функция НайтиОперациюПродажи(Реквизиты)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Имущество", Реквизиты.Ссылка);
	Запрос.УстановитьПараметр("Дата1", НачалоДня(Реквизиты.ДатаПродажи));
	Запрос.УстановитьПараметр("Дата2", КонецДня(Реквизиты.ДатаПродажи));
	Запрос.УстановитьПараметр("ВалютаПродажи", Реквизиты.ВалютаПродажи);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Перемещения.Ссылка
	|ИЗ
	|	Документ.УниверсальнаяОперация.Перемещения КАК Перемещения
	|ГДЕ
	|	Перемещения.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
	|	И Перемещения.ОбъектУчетаКт = &Имущество
	|	И Перемещения.ОбъектУчетаДт.Валюта = &ВалютаПродажи";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПоляПоОперацииПродажи()
	
	Если ЗначениеЗаполнено(ОперацияПродажи) Тогда
		
		ДокОбъект = ОперацияПродажи.ПолучитьОбъект();
		
		Для Каждого Строка Из ДокОбъект.Перемещения Цикл
			Если Строка.ОбъектУчетаКт = Объект.Ссылка Тогда
				Кошелек = Строка.ОбъектУчетаДт;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого Строка Из ДокОбъект.Доходы Цикл
			Если Строка.ОбъектУчета = Объект.Ссылка Тогда
				СтатьяДохода = Строка.СтатьяДохода;
				СуммаПрибыли = Строка.Сумма;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого Строка Из ДокОбъект.Расходы Цикл
			Если Строка.ОбъектУчета = Объект.Ссылка Тогда
				СтатьяРасхода = Строка.СтатьяРасхода;
				СуммаУбытка   = Строка.Сумма;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		УчетнаяСтоимость = Объект.ВыручкаОтПродажиВВалютеИмущества - СуммаПрибыли + СуммаУбытка;
		
	Иначе
		
		Кошелек = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьЭлементыФормы(Форма)
	
	Объект   = Форма.Объект;
	Элементы = Форма.Элементы;
	
	Элементы.Кошелек.Видимость = Форма.ОперацияДоступна;
	Элементы.НадписьНетОперации.Видимость = Не Форма.ОперацияДоступна;
	Элементы.ВалютаПродажи.ТолькоПросмотр = Форма.ОперацияДоступна;
	Элементы.ГруппаВыручкаВВалютеИмущества.Видимость = Объект.Валюта <> Объект.ВалютаПродажи;
	
	Элементы.СтраницыРезультата.Видимость = Форма.ОперацияДоступна;
	Элементы.ФормаОткрытьОперациюПродажи.Доступность = ЗначениеЗаполнено(Форма.ОперацияПродажи);
	Элементы.ФормаОтменитьПродажу.Доступность = ЗначениеЗаполнено(Объект.ДатаПродажи) 
					Или ЗначениеЗаполнено(Форма.ОперацияПродажи) ;
	
	Если Объект.ВыручкаОтПродажиВВалютеИмущества > Форма.УчетнаяСтоимость Тогда
		Элементы.СтраницыРезультата.ТекущаяСтраница = Элементы.СтраницаПрибыль;
	ИначеЕсли Объект.ВыручкаОтПродажиВВалютеИмущества < Форма.УчетнаяСтоимость Тогда
		Элементы.СтраницыРезультата.ТекущаяСтраница = Элементы.СтраницаУбыток;
	Иначе
		Элементы.СтраницыРезультата.ТекущаяСтраница = Элементы.СтраницаНетРезультата;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура КошелекПриИзмененииСервер()
	
	Если ЗначениеЗаполнено(Кошелек) Тогда
		Объект.ВалютаПродажи = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Кошелек, "Валюта")
	Иначе
		Объект.ВалютаПродажи = ВалютаУчета; 
	КонецЕсли;
	
	Элементы.ГруппаВыручкаВВалютеИмущества.Видимость = Объект.Валюта <> Объект.ВалютаПродажи;
	ПересчитатьВыручкуВВалютуИмущества(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПересчитатьВыручкуВВалютуИмущества(Форма)
	
	Объект   = Форма.Объект;
	Если Объект.Валюта = Объект.ВалютаПродажи Тогда
		Объект.ВыручкаОтПродажиВВалютеИмущества = Объект.ВыручкаОтПродажи;
	Иначе
		Объект.ВыручкаОтПродажиВВалютеИмущества = ПересчитатьВыручку(Объект);
	КонецЕсли;
	
	ПересчитатьПрибыльУбыток(Форма);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПересчитатьВыручку(Объект)
	
	Если Не ЗначениеЗаполнено(Объект.ВыручкаОтПродажи) Тогда
		Возврат 0;
	КонецЕсли;
	
	ДатаПродажи = ?(ЗначениеЗаполнено(Объект.ДатаПродажи), Объект.ДатаПродажи, ТекущаяДатаСеанса());
	Возврат РаботаСКурсамиВалют.ПересчитатьВВалюту(Объект.ВыручкаОтПродажи, 
									Объект.ВалютаПродажи, Объект.Валюта, ДатаПродажи);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ПересчитатьПрибыльУбыток(Форма)
	
	Объект   = Форма.Объект;
	Элементы = Форма.Элементы;
	Форма.СуммаПрибыли = 0;
	Форма.СуммаУбытка  = 0;
	Если ЗначениеЗаполнено(Форма.УчетнаяСтоимость) И Объект.ВыручкаОтПродажиВВалютеИмущества > Форма.УчетнаяСтоимость  Тогда
		Форма.СуммаПрибыли = Объект.ВыручкаОтПродажиВВалютеИмущества - Форма.УчетнаяСтоимость;
		Элементы.СтраницыРезультата.ТекущаяСтраница = Элементы.СтраницаПрибыль;
	ИначеЕсли ЗначениеЗаполнено(Форма.УчетнаяСтоимость) И Объект.ВыручкаОтПродажиВВалютеИмущества < Форма.УчетнаяСтоимость  Тогда
		Форма.СуммаУбытка = Форма.УчетнаяСтоимость - Объект.ВыручкаОтПродажиВВалютеИмущества;
		Элементы.СтраницыРезультата.ТекущаяСтраница = Элементы.СтраницаУбыток;
	Иначе
		Элементы.СтраницыРезультата.ТекущаяСтраница = Элементы.СтраницаНетРезультата;
	КонецЕсли;
	
КонецПроцедуры



&НаСервере
Процедура ЗаписатьОперациюПродажи(ОбъектИмущества)
	
	Если ЗначениеЗаполнено(ОперацияПродажи) Тогда
		ДокОбъект = ОперацияПродажи.ПолучитьОбъект();
	Иначе
		ДокОбъект = Документы.УниверсальнаяОперация.СоздатьДокумент();
	КонецЕсли;
	
	ДокОбъект.Расходы.Очистить();
	ДокОбъект.Доходы.Очистить();
	ДокОбъект.Перемещения.Очистить();
	
	Если Не ЗначениеЗаполнено(ОбъектИмущества.ДатаПродажи) Тогда
		ОбъектИмущества.ДатаПродажи = ТекущаяДатаСеанса();
	КонецЕсли;
	ДокОбъект.Дата = ОбъектИмущества.ДатаПродажи;
	
	Строка = ДокОбъект.Перемещения.Добавить();
	Строка.КомментарийСтроки = НСтр("ru='Выручка за проданное имущество'");
	
	КошелекДляНакоплений = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Кошелек, "ИспользоватьДляНакоплений");
	Строка.РазделУчетаДт = ?(КошелекДляНакоплений, ПланыСчетов.РазделыУчета.Накопления, ПланыСчетов.РазделыУчета.СвободныеДеньги);
	Строка.ОбъектУчетаДт = Кошелек;
	Строка.Валюта        = Объект.ВалютаПродажи;
	Строка.Сумма         = Объект.ВыручкаОтПродажи;
	
	Строка.РазделУчетаКт = ПланыСчетов.РазделыУчета.Имущество;
	Строка.ОбъектУчетаКт = Объект.Ссылка;
	Строка.ВалютаКт      = Объект.Валюта;
	Строка.СуммаКт       = Объект.ВыручкаОтПродажиВВалютеИмущества;
	
	Если Объект.ВыручкаОтПродажиВВалютеИмущества > УчетнаяСтоимость Тогда
		
		Строка = ДокОбъект.Доходы.Добавить();
		Строка.КомментарийСтроки = НСтр("ru='Прибыль от продажи имущества'");
		
		Строка.СтатьяДохода = СтатьяДохода;
		Строка.РазделУчета  = ПланыСчетов.РазделыУчета.Имущество;
		Строка.ОбъектУчета  = Объект.Ссылка;
		Строка.Валюта       = Объект.Валюта;
		Строка.Сумма        = СуммаПрибыли;
		
	ИначеЕсли Объект.ВыручкаОтПродажиВВалютеИмущества < УчетнаяСтоимость Тогда
		
		Строка = ДокОбъект.Расходы.Добавить();
		Строка.КомментарийСтроки = НСтр("ru='Убыток от продажи имущества'");
		
		Строка.СтатьяРасхода = СтатьяРасхода;
		Строка.РазделУчета  = ПланыСчетов.РазделыУчета.Имущество;
		Строка.ОбъектУчета   = Объект.Ссылка;
		Строка.Валюта        = Объект.Валюта;
		Строка.Сумма         = СуммаУбытка;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Комментарий) Тогда
		ДокОбъект.Комментарий = Объект.Комментарий;
	КонецЕсли;
	
	ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	ОперацияПродажи = ДокОбъект.Ссылка;
	УжеПродано = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьПродажуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ОтменитьПродажуСервер();
	Если Открыта() Тогда
		Закрыть();
	КонецЕсли;
	
	Оповестить("Записан элемент справочника", Новый Структура("ИмяСправочника,Ссылка,ВладелецФормы", "Имущество", Объект.Ссылка, ?(ТипЗнч(ВладелецФормы) = Тип("ФормаКлиентскогоПриложения"), ВладелецФормы.УникальныйИдентификатор, Неопределено)));
	Если ЗначениеЗаполнено(ОперацияПродажи) Тогда
		Оповестить("Записана операция", Новый Структура("Дата, ВидДокумента, Ссылка, ЭтоШаблон, ВладелецФормы", 
			Объект.ДатаПродажи, "УниверсальнаяОперация", ОперацияПродажи, Ложь, 
			?(ТипЗнч(ВладелецФормы) = Тип("ФормаКлиентскогоПриложения"), ВладелецФормы.УникальныйИдентификатор, Неопределено)));
	КонецЕсли;
	
	ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(НСтр("ru='Отменена продажа имущества ""%1""'"), Объект.Наименование));
	
КонецПроцедуры


&НаСервере
Процедура ОтменитьПродажуСервер()
	
	СпрОбъект = Объект.Ссылка.ПолучитьОбъект();
	СпрОбъект.ДатаПродажи = Неопределено;
	СпрОбъект.ВыручкаОтПродажи = 0;
	СпрОбъект.ВалютаПродажи = Неопределено;
	СпрОбъект.ВыручкаОтПродажиВВалютеИмущества = 0;
	СпрОбъект.Записать();
	
	Если ЗначениеЗаполнено(ОперацияПродажи) Тогда
		ДокОбъект = ОперацияПродажи.ПолучитьОбъект();
		ДокОбъект.УстановитьПометкуУдаления(Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
